tests/performance/IS_Stress_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="IS_Stress_Test_Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Plan HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">${ServiceEndpoint}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="Plan HTTP Cache Manager" enabled="true">
        <boolProp name="clearEachIteration">true</boolProp>
        <boolProp name="useExpires">true</boolProp>
        <boolProp name="CacheManager.controlledByThread">false</boolProp>
      </CacheManager>
      <hashTree/>
      <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Load Plan Level Parameters JSR223 PreProcessor">
        <stringProp name="scriptLanguage">groovy</stringProp>
        <stringProp name="cacheKey">true</stringProp>
        <stringProp name="script">// Run the loadparams groovy script to populate the serviceendpoint
def scriptFile = new File(&apos;./scripts/LoadBackendParams.groovy&apos;)
def scriptText = scriptFile.text
evaluate(scriptText)</stringProp>
      </JSR223PreProcessor>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Organization Requests" enabled="true">
        <intProp name="ThreadGroup.num_threads">1400</intProp>
        <intProp name="ThreadGroup.ramp_time">60</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="step1">
              <stringProp name="start">0</stringProp>
              <stringProp name="end">${__P(throughput_step,50)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step2">
              <stringProp name="start">${__P(throughput_step,50)}</stringProp>
              <stringProp name="end">${__P(throughput_step,50)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step3">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 2)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 2)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step4">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 3)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 3)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step5">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 4)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 4)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step6">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 5)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 5)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step7">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 6)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 6)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step8">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 7)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 7)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step9">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 8)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 8)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step10">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 9)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 9)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step11">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 10)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 10)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
            <collectionProp name="step12">
              <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 11)}</stringProp>
              <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 11)}</stringProp>
              <stringProp name="duration">${__P(step_duration,300)}</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Organization Request" enabled="true">
          <stringProp name="HTTPSampler.path">Organization?_revinclude=Endpoint%3Aorganization&amp;identifier=odsOrganisationCode%7C${ep_odscode}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="ODSCode Parameters" enabled="true">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">parameter_files/dos_search_odscodes.csv</stringProp>
            <boolProp name="ignoreFirstLine">true</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">true</boolProp>
            <stringProp name="shareMode">shareMode.group</stringProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="variableNames">ep_odscode</stringProp>
          </CSVDataSet>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>